Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.73/BZ25/edc/PIC32CX1012BZ25032.PIC
      <edc:SFRDef edc:_addr="0x41002034" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="MSR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CMCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC">
            <edc:SFRFieldDef edc:cname="EVENT_CNT" edc:desc="Monitor Event Counter" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x41002038" edc:offset="0x1FC8"/>
      <edc:SFRDef edc:_addr="0x41004000" edc:access="----nnnn-----nnn" edc:cname="CTRL" edc:impl="0xF07" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMAENABLE" edc:desc="DMA Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCENABLE" edc:desc="CRC Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="LVLEN0" edc:desc="Priority Level 0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVLEN1" edc:desc="Priority Level 1 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVLEN2" edc:desc="Priority Level 2 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVLEN3" edc:desc="Priority Level 3 Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41004002" edc:access="nnnnnnnn----nnnn" edc:cname="CRCCTRL" edc:impl="0xFF0F" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="CRCBEATSIZE" edc:desc="CRC Beat Size" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="BYTE" edc:desc="8-bit bus transfer" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HWORD" edc:desc="16-bit bus transfer" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="WORD" edc:desc="32-bit bus transfer" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CRCPOLY" edc:desc="CRC Polynomial Type" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="CRC16" edc:desc="CRC-16 (CRC-CCITT)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CRC32" edc:desc="CRC32 (IEEE 802.3)" edc:when="(field &amp; 0x3) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CRCSRC" edc:desc="CRC Input Source" edc:nzwidth="0x6">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="CRC Disabled" edc:when="(field &amp; 0x3F) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="IO" edc:desc="I/O interface" edc:when="(field &amp; 0x3F) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CRCMODE" edc:desc="CRC Operating Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="Default operating mode" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CRCMON" edc:desc="Memory CRC monitor operating mode" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="CRCGEN" edc:desc="Memory CRC generation operating mode" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41004004" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CRCDATAIN" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="CRCDATAIN" edc:desc="CRC Data Input" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41004008" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CRCCHKSUM" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="CRCCHKSUM" edc:desc="CRC Checksum" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100400C" edc:access="-----nnn" edc:cname="CRCSTATUS" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="CRCBUSY" edc:desc="CRC Module Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCZERO" edc:desc="CRC Zero" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERR" edc:desc="CRC Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100400D" edc:access="-------n" edc:cname="DBGCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="DBGRUN" edc:desc="Debug Run" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4100400E" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x41004010" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="SWTRIGCTRL" edc:impl="0xFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="SWTRIG0" edc:desc="Channel 0 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG1" edc:desc="Channel 1 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG2" edc:desc="Channel 2 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG3" edc:desc="Channel 3 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG4" edc:desc="Channel 4 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG5" edc:desc="Channel 5 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG6" edc:desc="Channel 6 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG7" edc:desc="Channel 7 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG8" edc:desc="Channel 8 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG9" edc:desc="Channel 9 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG10" edc:desc="Channel 10 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG11" edc:desc="Channel 11 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG12" edc:desc="Channel 12 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG13" edc:desc="Channel 13 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG14" edc:desc="Channel 14 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG15" edc:desc="Channel 15 Software Trigger" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
