Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.73/BZ25/edc/PIC32CX1012BZ25032.PIC
      <edc:SFRDef edc:_addr="0x41004028" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="BUSYCH" edc:impl="0xFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="BUSYCH0" edc:desc="Busy Channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH1" edc:desc="Busy Channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH2" edc:desc="Busy Channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH3" edc:desc="Busy Channel 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH4" edc:desc="Busy Channel 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH5" edc:desc="Busy Channel 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH6" edc:desc="Busy Channel 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH7" edc:desc="Busy Channel 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH8" edc:desc="Busy Channel 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH9" edc:desc="Busy Channel 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH10" edc:desc="Busy Channel 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH11" edc:desc="Busy Channel 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH12" edc:desc="Busy Channel 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH13" edc:desc="Busy Channel 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH14" edc:desc="Busy Channel 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH15" edc:desc="Busy Channel 15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100402C" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="PENDCH" edc:impl="0xFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="PENDCH0" edc:desc="Pending Channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH1" edc:desc="Pending Channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH2" edc:desc="Pending Channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH3" edc:desc="Pending Channel 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH4" edc:desc="Pending Channel 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH5" edc:desc="Pending Channel 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH6" edc:desc="Pending Channel 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH7" edc:desc="Pending Channel 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH8" edc:desc="Pending Channel 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH9" edc:desc="Pending Channel 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH10" edc:desc="Pending Channel 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH11" edc:desc="Pending Channel 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH12" edc:desc="Pending Channel 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH13" edc:desc="Pending Channel 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH14" edc:desc="Pending Channel 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH15" edc:desc="Pending Channel 15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41004030" edc:access="rrrrrrrrrrrrrrrrr--rrrrr----rrrr" edc:cname="ACTIVE" edc:impl="0xFFFF9F0F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="LVLEX0" edc:desc="Level 0 Channel Trigger Request Executing" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVLEX1" edc:desc="Level 1 Channel Trigger Request Executing" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVLEX2" edc:desc="Level 2 Channel Trigger Request Executing" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVLEX3" edc:desc="Level 3 Channel Trigger Request Executing" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ID" edc:desc="Active Channel ID" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ABUSY" edc:desc="Active Channel Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BTCNT" edc:desc="Active Channel Block Transfer Count" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41004034" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="BASEADDR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="BASEADDR" edc:desc="Descriptor Memory Base Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41004038" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="WRBADDR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="WRBADDR" edc:desc="Write-Back Memory Base Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
