Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.73/BZ25/edc/PIC32CX1012BZ25032.PIC
      <edc:SFRDef edc:_addr="0x44000014" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFGCON1CLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CFG"/>
      <edc:SFRDef edc:_addr="0x44000018" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFGCON1SET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CFG"/>
      <edc:SFRDef edc:_addr="0x4400001C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFGCON1INV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CFG"/>
      <edc:SFRDef edc:_addr="0x44000020" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnn-nnnnnn" edc:cname="CFGCON2" edc:impl="0xFFFFFFBF" edc:mclr="01111111011111111111111100111000" edc:nzwidth="0x20" edc:por="01111111011111111111111100111000" ltx:memberofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CFG">
            <edc:SFRFieldDef edc:cname="ACMP_CYCLE" edc:desc="AC SIB Comparator Result Wait Cycles" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="DMTINTV" edc:desc="Dead Man Timer Count Window Interval" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PMUTEST_VDD_EN" edc:desc="PMU Test Output or VDD/2 Enable via ADC IE12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="POSCMOD" edc:desc="Primary Oscillator Configuration" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="WDTRMCS" edc:desc="WDT RUN Mode Clock Select" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="SOSCSEL" edc:desc="SOSC Selection Configuration" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAKE2SPD" edc:desc="2-Speed startup enabled in Sleep mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CKSWEN" edc:desc="Software Clock Switching Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSCMEN" edc:desc="Fail-Safe Clock Monitor Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDTPSR" edc:desc="Watchdog Timer Post-scale Select Run" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="WDTSPGM" edc:desc="Watchdog Timer Stop during Flash Programming" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WINDIS" edc:desc="Windowed Watchdog Timer Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDTEN" edc:desc="Watchdog Timer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDTWINSZ" edc:desc="Watchdog Timer Window Size" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="DMTCNT" edc:desc="Dead Man Timer Count Select" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="DMTEN" edc:desc="Dead Man Timer Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44000024" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFGCON2CLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CFG"/>
      <edc:SFRDef edc:_addr="0x44000028" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFGCON2SET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CFG"/>
      <edc:SFRDef edc:_addr="0x4400002C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFGCON2INV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CFG"/>
      <edc:AdjustPoint edc:_addr="0x44000030" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x44000040" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFGCON4" edc:mclr="10000100000011100100000000000000" edc:nzwidth="0x20" edc:por="10000100000011100100000000000000" ltx:memberofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CFG">
            <edc:SFRFieldDef edc:cname="SOSCCFG" edc:desc="SOSC Configuration" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="RTCEVENT_SEL" edc:desc="RTC Event Selection" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="RTCEVENT_EN" edc:desc="Pad Output Enable for MCHP legacy RTC event output" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VBKP_1KCSEL" edc:desc="VDDBUKPCORE LPCLK Clock Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VBKP_32KCSEL" edc:desc="VDDBUKPCORE 32KHz clock source selection" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="VBKP_DIVSEL" edc:desc="VDDBUKPCORE LPCLK Clock Divider Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LPCLK_MOD" edc:desc="LPCLK modifier in counter/delay mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTCEFTYPE" edc:desc="RTC Event Type" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPEN_DLY" edc:desc="Charge-pump ready digital delay" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="DSZPBOREN" edc:desc="Deep Sleep Zero-Power BOR Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSWDTPS" edc:desc="Deep Sleep Watchdog Timer Postscale Select" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="DSWDTOSC" edc:desc="Deep Sleep Watchdog Timer Reference Clock Select" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSWDTEN" edc:desc="Deep Sleep Watchdog Timer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSEN" edc:desc="Deep Sleep Bit Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UVREGROVR" edc:desc="ULPVREG Retention Mode Override" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LPOSCEN" edc:desc="Low Power (Secondary) Oscillator Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTCNTM_CSEL" edc:desc="RTC Counter Mode Clock Select" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
