Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.73/BZ25/edc/PIC32CX1012BZ25032.PIC
      <edc:SFRDef edc:_addr="0x44001484" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCGIRQEN1CLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS"/>
      <edc:SFRDef edc:_addr="0x44001488" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCGIRQEN1SET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS"/>
      <edc:SFRDef edc:_addr="0x4400148C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCGIRQEN1INV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS"/>
      <edc:AdjustPoint edc:_addr="0x44001490" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x440014A0" edc:access="--------------------nnnnnnnnnnnn" edc:cname="ADCCSS1" edc:impl="0xFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADCHS">
            <edc:SFRFieldDef edc:cname="CSS0" edc:desc="Analog Common Scan Select bits" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SEL_AN0" edc:desc="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SKIP_AN0" edc:desc="Skip ANx for input scan" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CSS1" edc:desc="Analog Common Scan Select bits" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SEL_AN1" edc:desc="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SKIP_AN1" edc:desc="Skip ANx for input scan" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CSS2" edc:desc="Analog Common Scan Select bits" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SEL_AN2" edc:desc="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SKIP_AN2" edc:desc="Skip ANx for input scan" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CSS3" edc:desc="Analog Common Scan Select bits" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SEL_AN3" edc:desc="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SKIP_AN3" edc:desc="Skip ANx for input scan" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CSS4" edc:desc="Analog Common Scan Select bits" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SEL_AN4" edc:desc="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SKIP_AN4" edc:desc="Skip ANx for input scan" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CSS5" edc:desc="Analog Common Scan Select bits" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SEL_AN5" edc:desc="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SKIP_AN5" edc:desc="Skip ANx for input scan" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CSS6" edc:desc="Analog Common Scan Select bits" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SEL_AN6" edc:desc="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SKIP_AN6" edc:desc="Skip ANx for input scan" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CSS7" edc:desc="Analog Common Scan Select bits" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SEL_AN7" edc:desc="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SKIP_AN7" edc:desc="Skip ANx for input scan" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CSS8" edc:desc="Analog Common Scan Select bits" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SEL_AN8" edc:desc="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SKIP_AN8" edc:desc="Skip ANx for input scan" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CSS9" edc:desc="Analog Common Scan Select bits" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SEL_AN9" edc:desc="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SKIP_AN9" edc:desc="Skip ANx for input scan" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CSS10" edc:desc="Analog Common Scan Select bits" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SEL_AN10" edc:desc="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SKIP_AN10" edc:desc="Skip ANx for input scan" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CSS11" edc:desc="Analog Common Scan Select bits" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SEL_AN11" edc:desc="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SKIP_AN11" edc:desc="Skip ANx for input scan" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x440014A4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCSS1CLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS"/>
      <edc:SFRDef edc:_addr="0x440014A8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCSS1SET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS"/>
      <edc:SFRDef edc:_addr="0x440014AC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCSS1INV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS"/>
      <edc:AdjustPoint edc:_addr="0x440014B0" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x440014C0" edc:access="--------------------nnnnnnnnnnnn" edc:cname="ADCDSTAT1" edc:impl="0xFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADCHS">
            <edc:SFRFieldDef edc:cname="ARDY0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY11" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x440014C4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCDSTAT1CLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS"/>
      <edc:SFRDef edc:_addr="0x440014C8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCDSTAT1SET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS"/>
      <edc:SFRDef edc:_addr="0x440014CC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCDSTAT1INV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS"/>
      <edc:AdjustPoint edc:_addr="0x440014D0" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x440014E0" edc:access="------------------------nnnnnnnn" edc:cname="ADCCMPEN1" edc:impl="0xFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADCHS">
            <edc:SFRFieldDef edc:cname="CMPE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE7" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x440014E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCMPEN0CLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS"/>
      <edc:SFRDef edc:_addr="0x440014E8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCMPEN0SET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS"/>
      <edc:SFRDef edc:_addr="0x440014EC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCMPEN0INV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS"/>
      <edc:SFRDef edc:_addr="0x440014F0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCMP1" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADCHS">
            <edc:SFRFieldDef edc:cname="ADCMPLO" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="ADCMPHI" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x440014F4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCMP0CLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS"/>
      <edc:SFRDef edc:_addr="0x440014F8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCMP0SET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS"/>
      <edc:SFRDef edc:_addr="0x440014FC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCMP0INV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS"/>
      <edc:SFRDef edc:_addr="0x44001500" edc:access="------------------------nnnnnnnn" edc:cname="ADCCMPEN2" edc:impl="0xFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADCHS">
            <edc:SFRFieldDef edc:cname="CMPE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE7" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44001504" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCMPEN1CLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS"/>
      <edc:SFRDef edc:_addr="0x44001508" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCMPEN1SET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS"/>
      <edc:SFRDef edc:_addr="0x4400150C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCMPEN1INV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS"/>
      <edc:SFRDef edc:_addr="0x44001510" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCMP2" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADCHS">
            <edc:SFRFieldDef edc:cname="ADCMPLO" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="ADCMPHI" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44001514" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADDCMP1CLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS"/>
      <edc:SFRDef edc:_addr="0x44001518" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADDCMP1SET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS"/>
      <edc:SFRDef edc:_addr="0x4400151C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADDCMP1INV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS"/>
      <edc:AdjustPoint edc:_addr="0x44001520" edc:offset="0x80"/>
      <edc:SFRDef edc:_addr="0x440015A0" edc:access="nnnnnnnn---nnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCFLTR1" edc:impl="0xFF1FFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADCHS">
            <edc:SFRFieldDef edc:cname="FLT_DATA0" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="FLTINID0" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="AFIF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AFIEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRSAM0" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ADFMODE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATA16EN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AFEN0" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x440015A4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCFLTR0CLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS"/>
      <edc:SFRDef edc:_addr="0x440015A8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCFLTR0SET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS"/>
      <edc:SFRDef edc:_addr="0x440015AC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCFLTR0INV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS"/>
      <edc:SFRDef edc:_addr="0x440015B0" edc:access="nnnnnnnn---nnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCFLTR2" edc:impl="0xFF1FFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADCHS">
            <edc:SFRFieldDef edc:cname="FLT_DATA1" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="FLTINID1" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="AFIF1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AFIEN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRSAM1" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ADFMODE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATA16EN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AFEN1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
