Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.73/BZ25/edc/PIC32CX1012BZ25032.PIC
      <edc:SFRDef edc:_addr="0x44002384" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNENCLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x44002388" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNENSET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x4400238C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNENINV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x44002390" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="CNSTAT" edc:impl="0x7FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOB">
            <edc:SFRFieldDef edc:cname="CNSTAT0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT14" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44002394" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNSTATCLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x44002398" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNSTATSET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x4400239C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNSTATINV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x440023A0" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="CNNE" edc:impl="0x7FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOB">
            <edc:SFRFieldDef edc:cname="CNNE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE14" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x440023A4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNNECLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x440023A8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNNESET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x440023AC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNNEINV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x440023B0" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="CNF" edc:impl="0x7FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOB">
            <edc:SFRFieldDef edc:cname="CNF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF14" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x440023B4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNFCLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x440023B8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNFSET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x440023BC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNFINV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x440023C0" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="SRCON0" edc:impl="0x7FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOB">
            <edc:SFRFieldDef edc:cname="SR00" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR01" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR02" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR03" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR04" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR05" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR06" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR07" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR08" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR09" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR010" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR011" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR012" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR013" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR014" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x440023C4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SRCON0CLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x440023C8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SRCON0SET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x440023CC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SRCON0INV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x440023D0" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="SRCON1" edc:impl="0x7FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOB">
            <edc:SFRFieldDef edc:cname="SR10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR110" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR111" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR112" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR113" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR114" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x440023D4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SRCON1CLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x440023D8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SRCON1SET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x440023DC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SRCON1INV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:AdjustPoint edc:_addr="0x440023E0" edc:offset="0x10020"/>
      <edc:SFRDef edc:_addr="0x44012400" edc:access="-----nnn-nnn-nnn---n---nn-nnnnnn" edc:cname="CHECON" edc:impl="0x77711BF" edc:mclr="00000111000000000000000100001111" edc:nzwidth="0x20" edc:por="00000111000000000000000100001111" ltx:memberofperipheral="PCHE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PCHE">
            <edc:SFRFieldDef edc:cname="PFMWS" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PREFEN" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PFMSECEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADRWS" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CHEPERF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ICHECOH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCHECOH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ACHECOH" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ICHEINV" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCHEINV" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ACHEINV" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ICHEEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCHEEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ACHEEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x44012404" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x44012410" edc:access="----nn------------------nnnnnnnn" edc:cname="CHESTAT" edc:impl="0xC0000FF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PCHE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PCHE">
            <edc:SFRFieldDef edc:cname="PFMSECCNT" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0x12"/>
            <edc:SFRFieldDef edc:cname="PFMSEC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFMDED" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x44012414" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x44012420" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CHEHIT" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PCHE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PCHE">
            <edc:SFRFieldDef edc:cname="CHEHIT" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x44012424" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x44012430" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CHEMIS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PCHE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PCHE">
            <edc:SFRFieldDef edc:cname="CHEMIS" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x44012434" edc:offset="0x19CC"/>
      <edc:SFRDef edc:_addr="0x44013E00" edc:access="nn-----nnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SPICTRL" edc:impl="0xC1FFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PMU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMU">
            <edc:SFRFieldDef edc:cname="SPIWDATA" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="SPIADDR" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PMUCRST" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPIRST" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44013E04" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnn------n" edc:cname="SPISTATUS" edc:impl="0xFFFFFF81" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PMU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMU">
            <edc:SFRFieldDef edc:cname="SPIERR" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="SPIRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPIADDR" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="SPIRDATA" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44013E08" edc:access="nnnnnn-nnnnn-nnnnnnnnnnnnnnnnnnn" edc:cname="CLKCTRL" edc:impl="0xFDF7FFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PMU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMU">
            <edc:SFRFieldDef edc:cname="SPICLKDIV" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="PMUANA_BKBOREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPISRC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUCKCLKDIV" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="BUCKSRC" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="BACWD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MLDOEXTEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MVREFFSMEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP_CYCLE" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="BKCLK_HW_OVR" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MLDOEXT_BOREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADCBOREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUCKBOREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F_BCLK_CFG" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WLDOOFF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WCMRET" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44013E0C" edc:access="nnnnnnnn---nnnnn---nnnnn---nnnnn" edc:cname="MODECTRL1" edc:impl="0xFF1F1F1F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PMU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMU">
            <edc:SFRFieldDef edc:cname="VREG4CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG3CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG2CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG1CTRL" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="BUCKMODE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MLDOEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUCKEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44013E10" edc:access="nnnnnnnn---nnnnn---nnnnn---nnnnn" edc:cname="MODECTRL2" edc:impl="0xFF1F1F1F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PMU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMU">
            <edc:SFRFieldDef edc:cname="VREG4CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG3CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG2CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG1CTRL" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="BUCKMODE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MLDOEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUCKEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
