Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.73/BZ25/edc/PIC32CX1012BZ25032.PIC
      <edc:SFRDef edc:_addr="0x44013E5C" edc:access="---------------------------nnnnn" edc:cname="PMUISTAT" edc:impl="0x1F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PMU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMU">
            <edc:SFRFieldDef edc:cname="ADCBORINT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUCKBORINT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCMPINT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WCMIAINT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VBCIAINT" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:GPRDataSector edc:beginaddr="0x44014000" edc:endaddr="0x44016000" edc:regionid="BKUPRAM" edc:rw="rw"/>
    <edc:CodeSector atdf:pagesize="0x1000" edc:beginaddr="0x1000000" edc:endaddr="0x1100000" edc:regionid="IFLASH" edc:rw="rw"/>
    <edc:SFRDataSector edc:beginaddr="0xE0000000" edc:endaddr="0xE0042000" edc:regionid="PPB" edc:rw="rw">
      <edc:SFRDef edc:_addr="0xE0000000" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PORT0" edc:nzwidth="0x20" ltx:memberofperipheral="ITM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ITM">
            <edc:SFRFieldDef edc:cname="PORT" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0000004" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PORT1" edc:nzwidth="0x20" ltx:memberofperipheral="ITM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ITM">
            <edc:SFRFieldDef edc:cname="PORT" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0000008" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PORT2" edc:nzwidth="0x20" ltx:memberofperipheral="ITM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ITM">
            <edc:SFRFieldDef edc:cname="PORT" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000000C" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PORT3" edc:nzwidth="0x20" ltx:memberofperipheral="ITM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ITM">
            <edc:SFRFieldDef edc:cname="PORT" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0000010" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PORT4" edc:nzwidth="0x20" ltx:memberofperipheral="ITM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ITM">
            <edc:SFRFieldDef edc:cname="PORT" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0000014" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PORT5" edc:nzwidth="0x20" ltx:memberofperipheral="ITM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ITM">
            <edc:SFRFieldDef edc:cname="PORT" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0000018" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PORT6" edc:nzwidth="0x20" ltx:memberofperipheral="ITM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ITM">
            <edc:SFRFieldDef edc:cname="PORT" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000001C" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PORT7" edc:nzwidth="0x20" ltx:memberofperipheral="ITM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ITM">
            <edc:SFRFieldDef edc:cname="PORT" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0000020" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PORT8" edc:nzwidth="0x20" ltx:memberofperipheral="ITM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ITM">
            <edc:SFRFieldDef edc:cname="PORT" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0000024" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PORT9" edc:nzwidth="0x20" ltx:memberofperipheral="ITM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ITM">
            <edc:SFRFieldDef edc:cname="PORT" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0000028" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PORT10" edc:nzwidth="0x20" ltx:memberofperipheral="ITM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ITM">
            <edc:SFRFieldDef edc:cname="PORT" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000002C" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PORT11" edc:nzwidth="0x20" ltx:memberofperipheral="ITM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ITM">
            <edc:SFRFieldDef edc:cname="PORT" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0000030" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PORT12" edc:nzwidth="0x20" ltx:memberofperipheral="ITM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ITM">
            <edc:SFRFieldDef edc:cname="PORT" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0000034" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PORT13" edc:nzwidth="0x20" ltx:memberofperipheral="ITM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ITM">
            <edc:SFRFieldDef edc:cname="PORT" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0000038" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PORT14" edc:nzwidth="0x20" ltx:memberofperipheral="ITM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ITM">
            <edc:SFRFieldDef edc:cname="PORT" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
