Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.73/BZ25/edc/PIC32CX1012BZ25032.PIC
      <edc:DCRDef edc:_addr="0x45F90" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnn-nnnnnn" edc:cname="DEVCFG2" edc:factorydefault="0x5f74ff38" edc:impl="0xFFFFFFBF" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="FUSES">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="ACMP_CYCLE" edc:desc="AC Comparator Result Wait Cycles" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="_32US" edc:desc="32us" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="_64US" edc:desc="64us" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="_96US" edc:desc="96us" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="_128US" edc:desc="128us" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="_160US" edc:desc="160us" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="_196US" edc:desc="196us" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="_224US" edc:desc="224us" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="_256US" edc:desc="256us" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DMTINTV" edc:desc="Dead Man Timer Count Window Interval" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="WIN_0" edc:desc="Window/Interval value is zero" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="WIN_1_2" edc:desc="Window/Interval value is 1/2 counter value" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WIN_3_4" edc:desc="Window/Interval value is 3/4 counter value" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="WIN_7_8" edc:desc="Window/Interval value is 7/8 counter value" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="WIN_15_16" edc:desc="Window/Interval value is 15/16 counter value" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="WIN_31_32" edc:desc="Window/Interval value is 31/32 counter value" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="WIN_63_64" edc:desc="Window/Interval value is 63/64 counter value" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="WIN_127_128" edc:desc="Window/Interval value is 127/128 counter value" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="PMUTEST_VDD_EN" edc:desc="PMU Test Output or VDD/2 Enable via ADC IE12" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="PMU" edc:desc="PMU Test Output Monitor" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="VDD_DIV_2" edc:desc="VDD_div_2 Monitor" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="POSCMOD" edc:desc="Primary Oscillator Configuration" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="HS" edc:desc="" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDTRMCS" edc:desc="WDT RUN Mode Clock Select" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="LPRC" edc:desc="LPRC" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="SYSCLK" edc:desc="SYSCLK" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SOSCSEL" edc:desc="SOSC Selection Configuration" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="XTAL" edc:desc="" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="SCLKI" edc:desc="" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WAKE2SPD" edc:desc="2-Speed startup enabled in Sleep mode" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CKSWEN" edc:desc="Software Clock Switching Enable" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FSCMEN" edc:desc="Fail-Safe Clock Monitor Enable" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDTPSR" edc:desc="Watchdog Timer Post-scale Select Run" edc:nzwidth="0x5">
              <edc:DCRFieldSemantic edc:cname="PS1" edc:desc="1:1" edc:when="(field &amp; 0x1F) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="PS2" edc:desc="1:2" edc:when="(field &amp; 0x1F) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PS4" edc:desc="1:4" edc:when="(field &amp; 0x1F) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="PS8" edc:desc="1:8" edc:when="(field &amp; 0x1F) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PS16" edc:desc="1:16" edc:when="(field &amp; 0x1F) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="PS32" edc:desc="1:32" edc:when="(field &amp; 0x1F) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="PS64" edc:desc="1:64" edc:when="(field &amp; 0x1F) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="PS128" edc:desc="1:128" edc:when="(field &amp; 0x1F) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="PS256" edc:desc="1:256" edc:when="(field &amp; 0x1F) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="PS512" edc:desc="1:512" edc:when="(field &amp; 0x1F) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="PS1024" edc:desc="1:1024" edc:when="(field &amp; 0x1F) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="PS2048" edc:desc="1:2048" edc:when="(field &amp; 0x1F) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="PS4096" edc:desc="1:4096" edc:when="(field &amp; 0x1F) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="PS8192" edc:desc="1:8192" edc:when="(field &amp; 0x1F) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="PS16384" edc:desc="1:16384" edc:when="(field &amp; 0x1F) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="PS32768" edc:desc="1:32768" edc:when="(field &amp; 0x1F) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="PS65536" edc:desc="1:65536" edc:when="(field &amp; 0x1F) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="PS131072" edc:desc="1:131072" edc:when="(field &amp; 0x1F) == 0x11"/>
              <edc:DCRFieldSemantic edc:cname="PS262144" edc:desc="1:262144" edc:when="(field &amp; 0x1F) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="PS524288" edc:desc="1:524288" edc:when="(field &amp; 0x1F) == 0x13"/>
              <edc:DCRFieldSemantic edc:cname="PS1048576" edc:desc="1:1048576" edc:when="(field &amp; 0x1F) == 0x14"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDTSPGM" edc:desc="Watchdog Timer Stop during Flash Programming" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="STOPS" edc:desc="" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="RUNS" edc:desc="" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WINDIS" edc:desc="Windowed Watchdog Timer Disable" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="NORMAL" edc:desc="" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WINDOW" edc:desc="" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDTEN" edc:desc="Watchdog Timer Enable" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDTWINSZ" edc:desc="Watchdog Timer Window Size" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="WINSZ_25" edc:desc="Window size is 25%" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="WINSZ_37" edc:desc="Window size is 37.5%" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="WINSZ_50" edc:desc="Window size is 50%" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WINSZ_75" edc:desc="Window size is 75%" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DMTCNT" edc:desc="Dead Man Timer Count Select" edc:nzwidth="0x5">
              <edc:DCRFieldSemantic edc:cname="DMT8" edc:desc="2^8 (256)" edc:when="(field &amp; 0x1F) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="DMT9" edc:desc="2^9 (512)" edc:when="(field &amp; 0x1F) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="DMT10" edc:desc="2^10 (1024)" edc:when="(field &amp; 0x1F) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="DMT11" edc:desc="2^11 (2048)" edc:when="(field &amp; 0x1F) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="DMT12" edc:desc="2^12 (4096)" edc:when="(field &amp; 0x1F) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="DMT13" edc:desc="2^13 (8192)" edc:when="(field &amp; 0x1F) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="DMT14" edc:desc="2^14 (16384)" edc:when="(field &amp; 0x1F) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="DMT15" edc:desc="2^15 (32768)" edc:when="(field &amp; 0x1F) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="DMT16" edc:desc="2^16 (65536)" edc:when="(field &amp; 0x1F) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="DMT17" edc:desc="2^17 (131072)" edc:when="(field &amp; 0x1F) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="DMT18" edc:desc="2^18 (262144)" edc:when="(field &amp; 0x1F) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="DMT19" edc:desc="2^19 (524288)" edc:when="(field &amp; 0x1F) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="DMT20" edc:desc="2^20 (1048576)" edc:when="(field &amp; 0x1F) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="DMT21" edc:desc="2^21 (2097152)" edc:when="(field &amp; 0x1F) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="DMT22" edc:desc="2^22 (4194304)" edc:when="(field &amp; 0x1F) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="DMT23" edc:desc="2^23 (8388608)" edc:when="(field &amp; 0x1F) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="DMT24" edc:desc="2^24 (16777216)" edc:when="(field &amp; 0x1F) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="DMT25" edc:desc="2^25 (33554432)" edc:when="(field &amp; 0x1F) == 0x11"/>
              <edc:DCRFieldSemantic edc:cname="DMT26" edc:desc="2^26 (67108864)" edc:when="(field &amp; 0x1F) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="DMT27" edc:desc="2^27 (134217728)" edc:when="(field &amp; 0x1F) == 0x13"/>
              <edc:DCRFieldSemantic edc:cname="DMT28" edc:desc="2^28 (268435456)" edc:when="(field &amp; 0x1F) == 0x14"/>
              <edc:DCRFieldSemantic edc:cname="DMT29" edc:desc="2^29 (536870912)" edc:when="(field &amp; 0x1F) == 0x15"/>
              <edc:DCRFieldSemantic edc:cname="DMT30" edc:desc="2^30 (1073741824)" edc:when="(field &amp; 0x1F) == 0x16"/>
              <edc:DCRFieldSemantic edc:cname="DMT31" edc:desc="2^31 (2147483648)" edc:when="(field &amp; 0x1F) == 0x17"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DMTEN" edc:desc="Dead Man Timer Enable" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
